export const boardInfo: { id: number; name: string; }[] = [
  {
    "id": 758,
    "name": "似水流年"
  },
  {
    "id": 182,
    "name": "心灵之约"
  },
  {
    "id": 184,
    "name": "论坛指南"
  },
  {
    "id": 68,
    "name": "学习天地"
  },
  {
    "id": 581,
    "name": "科研学术"
  },
  {
    "id": 102,
    "name": "留学交流"
  },
  {
    "id": 304,
    "name": "外语学习"
  },
  {
    "id": 263,
    "name": "考研一族"
  },
  {
    "id": 105,
    "name": "编程技术"
  },
  {
    "id": 749,
    "name": "社科杂谈"
  },
  {
    "id": 100,
    "name": "校园信息"
  },
  {
    "id": 198,
    "name": "新生宝典"
  },
  {
    "id": 777,
    "name": "维权空间"
  },
  {
    "id": 357,
    "name": "时政讨论"
  },
  {
    "id": 459,
    "name": "实习兼职"
  },
  {
    "id": 515,
    "name": "住房信息"
  },
  {
    "id": 235,
    "name": "求职广场"
  },
  {
    "id": 782,
    "name": "投资理财"
  },
  {
    "id": 180,
    "name": "数码世界"
  },
  {
    "id": 30,
    "name": "动漫讨论"
  },
  {
    "id": 760,
    "name": "文学交流"
  },
  {
    "id": 759,
    "name": "曲苑杂坛"
  },
  {
    "id": 26,
    "name": "读书时光"
  },
  {
    "id": 164,
    "name": "影视综艺"
  },
  {
    "id": 25,
    "name": "天籁之音"
  },
  {
    "id": 312,
    "name": "怪力乱神"
  },
  {
    "id": 91,
    "name": "游戏广场"
  },
  {
    "id": 115,
    "name": "休闲娱乐"
  },
  {
    "id": 744,
    "name": "NexusHD"
  },
  {
    "id": 80,
    "name": "日用交易"
  },
  {
    "id": 562,
    "name": "数码交易"
  },
  {
    "id": 563,
    "name": "服饰美肤"
  },
  {
    "id": 569,
    "name": "代理专区"
  },
  {
    "id": 764,
    "name": "每日优惠"
  },
  {
    "id": 114,
    "name": "郁闷小屋"
  },
  {
    "id": 81,
    "name": "感性空间"
  },
  {
    "id": 152,
    "name": "缘分天空"
  },
  {
    "id": 144,
    "name": "一路走来"
  },
  {
    "id": 135,
    "name": "开怀一笑"
  },
  {
    "id": 15,
    "name": "体育运动"
  },
  {
    "id": 147,
    "name": "行者无疆"
  },
  {
    "id": 226,
    "name": "电脑医院"
  },
  {
    "id": 258,
    "name": "宠物情缘"
  },
  {
    "id": 551,
    "name": "绿色心情"
  },
  {
    "id": 173,
    "name": "光影留痕"
  },
  {
    "id": 353,
    "name": "真我风采"
  },
  {
    "id": 229,
    "name": "美食天地"
  },
  {
    "id": 101,
    "name": "个性生活"
  },
  {
    "id": 261,
    "name": "健康贴士"
  },
  {
    "id": 783,
    "name": "艺术园地"
  },
  {
    "id": 315,
    "name": "98网事"
  },
  {
    "id": 624,
    "name": "计算机通识答疑"
  },
  {
    "id": 412,
    "name": "精品课程C语言答疑中心"
  },
  {
    "id": 408,
    "name": "陈建海老师答疑"
  },
  {
    "id": 47,
    "name": "陈越老师答疑"
  },
  {
    "id": 49,
    "name": "方红光老师答疑"
  },
  {
    "id": 20,
    "name": "冯晓霞老师答疑"
  },
  {
    "id": 140,
    "name": "古红英老师答疑"
  },
  {
    "id": 50,
    "name": "徐镜春老师答疑"
  },
  {
    "id": 41,
    "name": "楼学庆老师答疑"
  },
  {
    "id": 52,
    "name": "陆汉权老师答疑"
  },
  {
    "id": 21,
    "name": "何善蒙老师答疑"
  },
  {
    "id": 205,
    "name": "张引老师的答疑版"
  },
  {
    "id": 151,
    "name": "孙建伶老师答疑"
  },
  {
    "id": 7,
    "name": "王何宇老师答疑"
  },
  {
    "id": 36,
    "name": "王云武老师答疑"
  },
  {
    "id": 83,
    "name": "魏宝刚老师答疑"
  },
  {
    "id": 149,
    "name": "李岩老师答疑"
  },
  {
    "id": 42,
    "name": "杨起帆老师答疑"
  },
  {
    "id": 23,
    "name": "肖少拥老师答疑"
  },
  {
    "id": 183,
    "name": "陆魁军老师答疑"
  },
  {
    "id": 292,
    "name": "高晴老师答疑"
  },
  {
    "id": 204,
    "name": "冯雁老师答疑"
  },
  {
    "id": 207,
    "name": "郑扣根老师答疑"
  },
  {
    "id": 208,
    "name": "翁恺老师答疑"
  },
  {
    "id": 224,
    "name": "钱抱清老师答疑"
  },
  {
    "id": 311,
    "name": "杨义群老师答疑"
  },
  {
    "id": 323,
    "name": "白洪欢老师答疑"
  },
  {
    "id": 325,
    "name": "贾厚玉老师答疑"
  },
  {
    "id": 375,
    "name": "张重辉老师答疑"
  },
  {
    "id": 383,
    "name": "张彤彧老师答疑"
  },
  {
    "id": 423,
    "name": "方宁老师答疑版"
  },
  {
    "id": 427,
    "name": "季江民老师答疑版块"
  },
  {
    "id": 432,
    "name": "陈平老师答疑"
  },
  {
    "id": 440,
    "name": "丁展平老师答疑"
  },
  {
    "id": 442,
    "name": "谈艺论戏"
  },
  {
    "id": 448,
    "name": "张军老师答疑"
  },
  {
    "id": 451,
    "name": "胡兰青老师答疑"
  },
  {
    "id": 454,
    "name": "董亚波老师答疑"
  },
  {
    "id": 457,
    "name": "史治国老师答疑"
  },
  {
    "id": 494,
    "name": "方富民老师答疑"
  },
  {
    "id": 501,
    "name": "朱晔老师答疑"
  },
  {
    "id": 513,
    "name": "邢卫老师答疑"
  },
  {
    "id": 514,
    "name": "周波老师答疑"
  },
  {
    "id": 535,
    "name": "面向对象程序设计答疑中心"
  },
  {
    "id": 540,
    "name": "陆维敏老师答疑"
  },
  {
    "id": 546,
    "name": "苏振华老师答疑"
  },
  {
    "id": 548,
    "name": "姜晓红老师答疑"
  },
  {
    "id": 559,
    "name": "吴江琴老师答疑"
  },
  {
    "id": 568,
    "name": "杨万喜老师答疑"
  },
  {
    "id": 574,
    "name": "胡敏老师答疑"
  },
  {
    "id": 578,
    "name": "蒋文华老师答疑"
  },
  {
    "id": 579,
    "name": "陈华钧老师答疑"
  },
  {
    "id": 588,
    "name": "吕萍老师答疑"
  },
  {
    "id": 589,
    "name": "黄正谦老师答疑"
  },
  {
    "id": 590,
    "name": "王强老师答疑"
  },
  {
    "id": 595,
    "name": "陈志坚老师答疑"
  },
  {
    "id": 575,
    "name": "顾宗华老师答疑版"
  },
  {
    "id": 599,
    "name": "彭笑刚老师答疑"
  },
  {
    "id": 600,
    "name": "楼辉老师答疑"
  },
  {
    "id": 601,
    "name": "沈钦仙老师答疑"
  },
  {
    "id": 602,
    "name": "孙凌云老师答疑"
  },
  {
    "id": 603,
    "name": "孟涛老师答疑"
  },
  {
    "id": 615,
    "name": "孟炳泉老师答疑"
  },
  {
    "id": 626,
    "name": "杨颖老师答疑"
  },
  {
    "id": 629,
    "name": "陈实老师答疑"
  },
  {
    "id": 631,
    "name": "管理学课程交流"
  },
  {
    "id": 632,
    "name": "陈纯老师答疑"
  },
  {
    "id": 633,
    "name": "近现代中国的人物研究答疑版"
  },
  {
    "id": 634,
    "name": "董平老师答疑"
  },
  {
    "id": 635,
    "name": "戴俊飞老师答疑版"
  },
  {
    "id": 640,
    "name": "刘海风老师答疑"
  },
  {
    "id": 710,
    "name": "沈语冰老师答疑"
  },
  {
    "id": 714,
    "name": "王跃明老师答疑"
  },
  {
    "id": 723,
    "name": "李浩然老师答疑"
  },
  {
    "id": 724,
    "name": "胡吉明老师答疑"
  },
  {
    "id": 726,
    "name": "董玮老师答疑"
  },
  {
    "id": 727,
    "name": "王毅老师答疑"
  },
  {
    "id": 728,
    "name": "陈文智老师答疑"
  },
  {
    "id": 733,
    "name": "陈奇老师答疑版"
  },
  {
    "id": 745,
    "name": "刘新国老师答疑"
  },
  {
    "id": 751,
    "name": "李啸风物理化学答疑"
  },
  {
    "id": 752,
    "name": "雷勇老师答疑"
  },
  {
    "id": 761,
    "name": "高在峰老师课程交流"
  },
  {
    "id": 778,
    "name": "彭笑刚大学化学答疑"
  },
  {
    "id": 248,
    "name": "计算机学院"
  },
  {
    "id": 294,
    "name": "竺可桢学院"
  },
  {
    "id": 307,
    "name": "人文学院"
  },
  {
    "id": 145,
    "name": "传媒学院"
  },
  {
    "id": 352,
    "name": "经济学院"
  },
  {
    "id": 362,
    "name": "教育杏坛"
  },
  {
    "id": 193,
    "name": "生仪大家庭"
  },
  {
    "id": 158,
    "name": "E电园"
  },
  {
    "id": 67,
    "name": "管理学院"
  },
  {
    "id": 285,
    "name": "碧水青禾"
  },
  {
    "id": 241,
    "name": "医学院"
  },
  {
    "id": 246,
    "name": "外国语学院"
  },
  {
    "id": 319,
    "name": "光华法学院"
  },
  {
    "id": 320,
    "name": "生命科学学院"
  },
  {
    "id": 321,
    "name": "生工食品学院"
  },
  {
    "id": 341,
    "name": "药学院"
  },
  {
    "id": 377,
    "name": "动科天地CAS"
  },
  {
    "id": 344,
    "name": "环资经纬"
  },
  {
    "id": 351,
    "name": "天下为公"
  },
  {
    "id": 469,
    "name": "航空航天学院"
  },
  {
    "id": 623,
    "name": "海洋学院"
  },
  {
    "id": 58,
    "name": "信电ISEE"
  },
  {
    "id": 214,
    "name": "不败光电"
  },
  {
    "id": 371,
    "name": "控制天下"
  },
  {
    "id": 754,
    "name": "我是工程师"
  },
  {
    "id": 255,
    "name": "格物致理"
  },
  {
    "id": 57,
    "name": "数学之韵"
  },
  {
    "id": 284,
    "name": "建工学院"
  },
  {
    "id": 775,
    "name": "地球科学学院"
  },
  {
    "id": 774,
    "name": "心理系"
  },
  {
    "id": 773,
    "name": "化学系"
  },
  {
    "id": 772,
    "name": "能源工程学院"
  },
  {
    "id": 771,
    "name": "机械工程学院"
  },
  {
    "id": 770,
    "name": "化工学院"
  },
  {
    "id": 769,
    "name": "高分子系"
  },
  {
    "id": 768,
    "name": "材料学院"
  },
  {
    "id": 767,
    "name": "海宁国际"
  },
  {
    "id": 766,
    "name": "艺韵古欢"
  },
  {
    "id": 765,
    "name": "马克思主义学院"
  },
  {
    "id": 784,
    "name": "哲学院(筹)"
  },
  {
    "id": 785,
    "name": "文学院(筹)"
  },
  {
    "id": 786,
    "name": "历史学院(筹)"
  },
  {
    "id": 437,
    "name": "社团百花园"
  },
  {
    "id": 330,
    "name": "学生社团联合会"
  },
  {
    "id": 254,
    "name": "学生旅游协会"
  },
  {
    "id": 329,
    "name": "程序设计竞赛"
  },
  {
    "id": 216,
    "name": "梦想天堂"
  },
  {
    "id": 206,
    "name": "DFM街舞社"
  },
  {
    "id": 195,
    "name": "法学研究会"
  },
  {
    "id": 194,
    "name": "梵音剧社"
  },
  {
    "id": 176,
    "name": "Fantasy动漫社"
  },
  {
    "id": 165,
    "name": "绿之源协会"
  },
  {
    "id": 310,
    "name": "心理学会"
  },
  {
    "id": 334,
    "name": "红十字会学生分会"
  },
  {
    "id": 347,
    "name": "学生三农协会"
  },
  {
    "id": 369,
    "name": "学生空手道协会"
  },
  {
    "id": 355,
    "name": "辩论队与求是辩论社"
  },
  {
    "id": 361,
    "name": "学生无极棋社"
  },
  {
    "id": 393,
    "name": "爱心社"
  },
  {
    "id": 431,
    "name": "学生校友联络协会"
  },
  {
    "id": 436,
    "name": "杨式太极拳协会"
  },
  {
    "id": 519,
    "name": "机器人协会"
  },
  {
    "id": 520,
    "name": "心系西部协会"
  },
  {
    "id": 446,
    "name": "桥牌协会"
  },
  {
    "id": 576,
    "name": "黑白剧社"
  },
  {
    "id": 434,
    "name": "亦心·民韵舞社"
  },
  {
    "id": 213,
    "name": "墨语茗音"
  },
  {
    "id": 618,
    "name": "成长互助训练营GCC"
  },
  {
    "id": 628,
    "name": "E志者协会"
  },
  {
    "id": 303,
    "name": "国防协会"
  },
  {
    "id": 713,
    "name": "未企俱乐部"
  },
  {
    "id": 287,
    "name": "SCDA"
  },
  {
    "id": 736,
    "name": "研创CIE"
  },
  {
    "id": 264,
    "name": "浙大广电"
  },
  {
    "id": 781,
    "name": "心理帮帮团"
  },
  {
    "id": 467,
    "name": "三湘四水（湖南）"
  },
  {
    "id": 468,
    "name": "津门故里（天津）"
  },
  {
    "id": 471,
    "name": "齐鲁青未了（山东）"
  },
  {
    "id": 472,
    "name": "蓉汇贯川（四川）"
  },
  {
    "id": 475,
    "name": "三秦大地（陕西）"
  },
  {
    "id": 481,
    "name": "江南西道（江西）"
  },
  {
    "id": 482,
    "name": "一皖情深（安徽）"
  },
  {
    "id": 480,
    "name": "八闽来风（福建）"
  },
  {
    "id": 483,
    "name": "燕赵飞歌（河北）"
  },
  {
    "id": 484,
    "name": "吴韵汉风（江苏）"
  },
  {
    "id": 485,
    "name": "辽地永宁（辽宁）"
  },
  {
    "id": 486,
    "name": "新上海滩（上海）"
  },
  {
    "id": 489,
    "name": "黑土风情（黑龙江）"
  },
  {
    "id": 491,
    "name": "白山松水（吉林）"
  },
  {
    "id": 492,
    "name": "巴渝人家（重庆）"
  },
  {
    "id": 493,
    "name": "天山南北（新疆）"
  },
  {
    "id": 498,
    "name": "晋善晋美（山西）"
  },
  {
    "id": 502,
    "name": "塞上风光（内蒙古）"
  },
  {
    "id": 503,
    "name": "彩云之南（云南）"
  },
  {
    "id": 504,
    "name": "荆楚纵横（湖北）"
  },
  {
    "id": 505,
    "name": "邦锦梅朵（西藏）"
  },
  {
    "id": 506,
    "name": "粤来客栈（广东）"
  },
  {
    "id": 507,
    "name": "鼎豫中原（河南）"
  },
  {
    "id": 511,
    "name": "丝路花雨（甘肃）"
  },
  {
    "id": 779,
    "name": "塞上江南（宁夏）"
  },
  {
    "id": 780,
    "name": "西域之冲（青海）"
  },
  {
    "id": 550,
    "name": "皇城根儿（北京）"
  },
  {
    "id": 596,
    "name": "八桂飘香（广西）"
  },
  {
    "id": 625,
    "name": "黔山秀水（贵州）"
  },
  {
    "id": 642,
    "name": "椰风海韵（海南）"
  },
  {
    "id": 474,
    "name": "八婺风情（金华）"
  },
  {
    "id": 476,
    "name": "秀山丽水（丽水）"
  },
  {
    "id": 477,
    "name": "山水明州（宁波）"
  },
  {
    "id": 478,
    "name": "太湖之州（湖州）"
  },
  {
    "id": 479,
    "name": "金瓯白鹿城（温州）"
  },
  {
    "id": 488,
    "name": "四省通衢（衢州）"
  },
  {
    "id": 490,
    "name": "古越绍兴（绍兴）"
  },
  {
    "id": 495,
    "name": "千岛海韵（舟山）"
  },
  {
    "id": 496,
    "name": "山海台州（台州）"
  },
  {
    "id": 497,
    "name": "烟雨江南（嘉兴）"
  },
  {
    "id": 487,
    "name": "诗画杭城（杭州）"
  },
  {
    "id": 17,
    "name": "论坛事务"
  },
  {
    "id": 326,
    "name": "集思广益"
  },
  {
    "id": 221,
    "name": "版主会议厅"
  },
  {
    "id": 40,
    "name": "站务讨论"
  },
  {
    "id": 620,
    "name": "赞助合作"
  },
  {
    "id": 611,
    "name": "通知通告"
  },
  {
    "id": 614,
    "name": "莫失莫忘"
  },
  {
    "id": 286,
    "name": "坛庆策划"
  },
  {
    "id": 245,
    "name": "技术组工作室"
  },
  {
    "id": 753,
    "name": "运营管理团队"
  },
  {
    "id": 747,
    "name": "Banner申请"
  },
  {
    "id":788,
    "name": "车马行空"
  }
]